Elements in [Design Option] will be deleted
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ElementsWillBeDeleted { get; }
  Visual Basic
Public Shared ReadOnly Property ElementsWillBeDeleted As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ElementsWillBeDeleted {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace